espressif/esp-idf/components/soc/soc/esp32s3/include/soc/spi_mem_reg.h
#define SPI_MEM_USER2_REG(i) (REG_SPI_MEM_BASE(i) + 0x020)
/* SPI_MEM_USR_COMMAND_BITLEN : R/W ;bitpos:[31:28] ;default: 4'd7 ; */
/*description: The length in bits of command phase. The register value shall be (bit_num-1)*/
#define SPI_MEM_USR_COMMAND_BITLEN 0x0000000F
#define SPI_MEM_USR_COMMAND_BITLEN_M ((SPI_MEM_USR_COMMAND_BITLEN_V) << (SPI_MEM_USR_COMMAND_BITLEN_S))
#define SPI_MEM_USR_COMMAND_BITLEN_V 0xF
#define SPI_MEM_USR_COMMAND_BITLEN_S 28
/* SPI_MEM_USR_COMMAND_VALUE : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: The value of  command.*/
#define SPI_MEM_USR_COMMAND_VALUE 0x0000FFFF
#define SPI_MEM_USR_COMMAND_VALUE_M ((SPI_MEM_USR_COMMAND_VALUE_V) << (SPI_MEM_USR_COMMAND_VALUE_S))
#define SPI_MEM_USR_COMMAND_VALUE_V 0xFFFF
#define SPI_MEM_USR_COMMAND_VALUE_S 0

#define SPI_MEM_RD_STATUS_REG(i) (REG_SPI_MEM_BASE(i) + 0x02C)
/* SPI_MEM_WB_MODE : R/W ;bitpos:[23:16] ;default: 8'h00 ; */
/*description: Mode bits in the flash fast read mode  it is combined with spi_mem_fastrd_mode
 bit.*/
#define SPI_MEM_WB_MODE 0x000000FF
#define SPI_MEM_WB_MODE_M ((SPI_MEM_WB_MODE_V) << (SPI_MEM_WB_MODE_S))
#define SPI_MEM_WB_MODE_V 0xFF
#define SPI_MEM_WB_MODE_S 16

#define SPI_MEM_EXT_ADDR_REG(i) (REG_SPI_MEM_BASE(i) + 0x030)
/* SPI_MEM_EXT_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The register are the higher 32bits in the 64 bits address mode.*/
#define SPI_MEM_EXT_ADDR 0xFFFFFFFF
#define SPI_MEM_EXT_ADDR_M ((SPI_MEM_EXT_ADDR_V) << (SPI_MEM_EXT_ADDR_S))
#define SPI_MEM_EXT_ADDR_V 0xFFFFFFFF
#define SPI_MEM_EXT_ADDR_S 0

#define SPI_MEM_MISC_REG(i) (REG_SPI_MEM_BASE(i) + 0x034)
/* SPI_MEM_CS_KEEP_ACTIVE : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: spi cs line keep low when the bit is set.*/
#define SPI_MEM_CS_KEEP_ACTIVE (BIT(10))
#define SPI_MEM_CS_KEEP_ACTIVE_M (BIT(10))
#define SPI_MEM_CS_KEEP_ACTIVE_V 0x1
#define SPI_MEM_CS_KEEP_ACTIVE_S 10
/* SPI_MEM_CK_IDLE_EDGE : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: 1: spi clk line is high when idle     0: spi clk line is low when idle*/
#define SPI_MEM_CK_IDLE_EDGE (BIT(9))
#define SPI_MEM_CK_IDLE_EDGE_M (BIT(9))
#define SPI_MEM_CK_IDLE_EDGE_V 0x1
#define SPI_MEM_CK_IDLE_EDGE_S 9
/* SPI_MEM_SSUB_PIN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: For SPI0   sram is connected to SUBPINs.*/
#define SPI_MEM_SSUB_PIN (BIT(8))
#define SPI_MEM_SSUB_PIN_M (BIT(8))
#define SPI_MEM_SSUB_PIN_V 0x1
#define SPI_MEM_SSUB_PIN_S 8
/* SPI_MEM_FSUB_PIN : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: For SPI0   flash is connected to SUBPINs.*/
#define SPI_MEM_FSUB_PIN (BIT(7))
#define SPI_MEM_FSUB_PIN_M (BIT(7))
#define SPI_MEM_FSUB_PIN_V 0x1
#define SPI_MEM_FSUB_PIN_S 7
/* SPI_MEM_TRANS_END_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable the intterrupt of SPI transmitting done.*/
#define SPI_MEM_TRANS_END_INT_ENA (BIT(4))
#define SPI_MEM_TRANS_END_INT_ENA_M (BIT(4))
#define SPI_MEM_TRANS_END_INT_ENA_V 0x1
#define SPI_MEM_TRANS_END_INT_ENA_S 4
/* SPI_MEM_TRANS_END : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to indicate the transimitting is done.*/
#define SPI_MEM_TRANS_END (BIT(3))
#define SPI_MEM_TRANS_END_M (BIT(3))
#define SPI_MEM_TRANS_END_V 0x1
#define SPI_MEM_TRANS_END_S 3

#define SPI_MEM_TX_CRC_REG(i) (REG_SPI_MEM_BASE(i) + 0x038)
/* SPI_MEM_TX_CRC_DATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: For SPI1  the value of crc32.*/
#define SPI_MEM_TX_CRC_DATA 0xFFFFFFFF
#define SPI_MEM_TX_CRC_DATA_M ((SPI_MEM_TX_CRC_DATA_V) << (SPI_MEM_TX_CRC_DATA_S))
#define SPI_MEM_TX_CRC_DATA_V 0xFFFFFFFF
#define SPI_MEM_TX_CRC_DATA_S 0

#define SPI_MEM_CACHE_FCTRL_REG(i) (REG_SPI_MEM_BASE(i) + 0x03C)
/* SPI_MEM_FADDR_QUAD : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: For SPI0 flash  address phase apply 4 signals. 1: enable 0: disable.
  The bit is the same with spi_mem_fread_qio.*/
#define SPI_MEM_FADDR_QUAD (BIT(8))
#define SPI_MEM_FADDR_QUAD_M (BIT(8))
#define SPI_MEM_FADDR_QUAD_V 0x1
#define SPI_MEM_FADDR_QUAD_S 8
/* SPI_MEM_FDOUT_QUAD : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: For SPI0 flash  dout phase apply 4 signals. 1: enable 0: disable.
  The bit is the same with spi_mem_fread_qio.*/
#define SPI_MEM_FDOUT_QUAD (BIT(7))
#define SPI_MEM_FDOUT_QUAD_M (BIT(7))
#define SPI_MEM_FDOUT_QUAD_V 0x1
#define SPI_MEM_FDOUT_QUAD_S 7
/* SPI_MEM_FDIN_QUAD : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: For SPI0 flash  din phase apply 4 signals. 1: enable 0: disable.
  The bit is the same with spi_mem_fread_qio.*/
#define SPI_MEM_FDIN_QUAD (BIT(6))
#define SPI_MEM_FDIN_QUAD_M (BIT(6))
#define SPI_MEM_FDIN_QUAD_V 0x1
#define SPI_MEM_FDIN_QUAD_S 6
/* SPI_MEM_FADDR_DUAL : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: For SPI0 flash  address phase apply 2 signals. 1: enable 0: disable.
  The bit is the same with spi_mem_fread_dio.*/
#define SPI_MEM_FADDR_DUAL (BIT(5))
#define SPI_MEM_FADDR_DUAL_M (BIT(5))
#define SPI_MEM_FADDR_DUAL_V 0x1
#define SPI_MEM_FADDR_DUAL_S 5
/* SPI_MEM_FDOUT_DUAL : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: For SPI0 flash  dout phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_fread_dio.*/
#define SPI_MEM_FDOUT_DUAL (BIT(4))
#define SPI_MEM_FDOUT_DUAL_M (BIT(4))
#define SPI_MEM_FDOUT_DUAL_V 0x1
#define SPI_MEM_FDOUT_DUAL_S 4
/* SPI_MEM_FDIN_DUAL : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0 flash  din phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_fread_dio.*/
#define SPI_MEM_FDIN_DUAL (BIT(3))
#define SPI_MEM_FDIN_DUAL_M (BIT(3))
#define SPI_MEM_FDIN_DUAL_V 0x1
#define SPI_MEM_FDIN_DUAL_S 3
/* SPI_MEM_CACHE_FLASH_USR_CMD : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0   cache  read flash for user define command  1: enable  0:disable.*/
#define SPI_MEM_CACHE_FLASH_USR_CMD (BIT(2))
#define SPI_MEM_CACHE_FLASH_USR_CMD_M (BIT(2))
#define SPI_MEM_CACHE_FLASH_USR_CMD_V 0x1
#define SPI_MEM_CACHE_FLASH_USR_CMD_S 2
/* SPI_MEM_CACHE_USR_CMD_4BYTE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0   cache  read flash with 4 bytes command  1: enable  0:disable.*/
#define SPI_MEM_CACHE_USR_CMD_4BYTE (BIT(1))
#define SPI_MEM_CACHE_USR_CMD_4BYTE_M (BIT(1))
#define SPI_MEM_CACHE_USR_CMD_4BYTE_V 0x1
#define SPI_MEM_CACHE_USR_CMD_4BYTE_S 1
/* SPI_MEM_CACHE_REQ_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0  Cache access enable  1: enable  0:disable.*/
#define SPI_MEM_CACHE_REQ_EN (BIT(0))
#define SPI_MEM_CACHE_REQ_EN_M (BIT(0))
#define SPI_MEM_CACHE_REQ_EN_V 0x1
#define SPI_MEM_CACHE_REQ_EN_S 0

#define SPI_MEM_CACHE_SCTRL_REG(i) (REG_SPI_MEM_BASE(i) + 0x040)
/* SPI_MEM_SRAM_WDUMMY_CYCLELEN : R/W ;bitpos:[27:22] ;default: 6'b1 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of write
 dummy phase. The register value shall be (bit_num-1).*/
#define SPI_MEM_SRAM_WDUMMY_CYCLELEN 0x0000003F
#define SPI_MEM_SRAM_WDUMMY_CYCLELEN_M ((SPI_MEM_SRAM_WDUMMY_CYCLELEN_V) << (SPI_MEM_SRAM_WDUMMY_CYCLELEN_S))
#define SPI_MEM_SRAM_WDUMMY_CYCLELEN_V 0x3F
#define SPI_MEM_SRAM_WDUMMY_CYCLELEN_S 22
/* SPI_MEM_SRAM_OCT : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: reserved*/
#define SPI_MEM_SRAM_OCT (BIT(21))
#define SPI_MEM_SRAM_OCT_M (BIT(21))
#define SPI_MEM_SRAM_OCT_V 0x1
#define SPI_MEM_SRAM_OCT_S 21
/* SPI_MEM_CACHE_SRAM_USR_WCMD : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode cache write sram for user define command*/
#define SPI_MEM_CACHE_SRAM_USR_WCMD (BIT(20))
#define SPI_MEM_CACHE_SRAM_USR_WCMD_M (BIT(20))
#define SPI_MEM_CACHE_SRAM_USR_WCMD_V 0x1
#define SPI_MEM_CACHE_SRAM_USR_WCMD_S 20
/* SPI_MEM_SRAM_ADDR_BITLEN : R/W ;bitpos:[19:14] ;default: 6'd23 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of address
 phase. The register value shall be (bit_num-1).*/
#define SPI_MEM_SRAM_ADDR_BITLEN 0x0000003F
#define SPI_MEM_SRAM_ADDR_BITLEN_M ((SPI_MEM_SRAM_ADDR_BITLEN_V) << (SPI_MEM_SRAM_ADDR_BITLEN_S))
#define SPI_MEM_SRAM_ADDR_BITLEN_V 0x3F
#define SPI_MEM_SRAM_ADDR_BITLEN_S 14
/* SPI_MEM_SRAM_RDUMMY_CYCLELEN : R/W ;bitpos:[11:6] ;default: 6'b1 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of read
 dummy phase. The register value shall be (bit_num-1).*/
#define SPI_MEM_SRAM_RDUMMY_CYCLELEN 0x0000003F
#define SPI_MEM_SRAM_RDUMMY_CYCLELEN_M ((SPI_MEM_SRAM_RDUMMY_CYCLELEN_V) << (SPI_MEM_SRAM_RDUMMY_CYCLELEN_S))
#define SPI_MEM_SRAM_RDUMMY_CYCLELEN_V 0x3F
#define SPI_MEM_SRAM_RDUMMY_CYCLELEN_S 6
/* SPI_MEM_CACHE_SRAM_USR_RCMD : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode cache read sram for user define command.*/
#define SPI_MEM_CACHE_SRAM_USR_RCMD (BIT(5))
#define SPI_MEM_CACHE_SRAM_USR_RCMD_M (BIT(5))
#define SPI_MEM_CACHE_SRAM_USR_RCMD_V 0x1
#define SPI_MEM_CACHE_SRAM_USR_RCMD_S 5
/* SPI_MEM_USR_RD_SRAM_DUMMY : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 phase for read operations.*/
#define SPI_MEM_USR_RD_SRAM_DUMMY (BIT(4))
#define SPI_MEM_USR_RD_SRAM_DUMMY_M (BIT(4))
#define SPI_MEM_USR_RD_SRAM_DUMMY_V 0x1
#define SPI_MEM_USR_RD_SRAM_DUMMY_S 4
/* SPI_MEM_USR_WR_SRAM_DUMMY : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 phase for write operations.*/
#define SPI_MEM_USR_WR_SRAM_DUMMY (BIT(3))
#define SPI_MEM_USR_WR_SRAM_DUMMY_M (BIT(3))
#define SPI_MEM_USR_WR_SRAM_DUMMY_V 0x1
#define SPI_MEM_USR_WR_SRAM_DUMMY_S 3
/* SPI_MEM_USR_SRAM_QIO : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  spi quad I/O mode enable  1: enable  0:disable*/
#define SPI_MEM_USR_SRAM_QIO (BIT(2))
#define SPI_MEM_USR_SRAM_QIO_M (BIT(2))
#define SPI_MEM_USR_SRAM_QIO_V 0x1
#define SPI_MEM_USR_SRAM_QIO_S 2
/* SPI_MEM_USR_SRAM_DIO : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  spi dual I/O mode enable  1: enable  0:disable*/
#define SPI_MEM_USR_SRAM_DIO (BIT(1))
#define SPI_MEM_USR_SRAM_DIO_M (BIT(1))
#define SPI_MEM_USR_SRAM_DIO_V 0x1
#define SPI_MEM_USR_SRAM_DIO_S 1
/* SPI_MEM_CACHE_USR_SCMD_4BYTE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  cache read flash with 4 bytes
 command  1: enable  0:disable.*/
#define SPI_MEM_CACHE_USR_SCMD_4BYTE (BIT(0))
#define SPI_MEM_CACHE_USR_SCMD_4BYTE_M (BIT(0))
#define SPI_MEM_CACHE_USR_SCMD_4BYTE_V 0x1
#define SPI_MEM_CACHE_USR_SCMD_4BYTE_S 0

#define SPI_MEM_SRAM_CMD_REG(i) (REG_SPI_MEM_BASE(i) + 0x044)
/* SPI_MEM_SDUMMY_OUT : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: In the dummy phase the signal level of spi is output by the spi controller.*/
#define SPI_MEM_SDUMMY_OUT (BIT(22))
#define SPI_MEM_SDUMMY_OUT_M (BIT(22))
#define SPI_MEM_SDUMMY_OUT_V 0x1
#define SPI_MEM_SDUMMY_OUT_S 22
/* SPI_MEM_SCMD_OCT : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: For SPI0 sram  cmd phase apply 8 signals. 1: enable 0: disable.*/
#define SPI_MEM_SCMD_OCT (BIT(21))
#define SPI_MEM_SCMD_OCT_M (BIT(21))
#define SPI_MEM_SCMD_OCT_V 0x1
#define SPI_MEM_SCMD_OCT_S 21
/* SPI_MEM_SADDR_OCT : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: For SPI0 sram  address phase apply 4 signals. 1: enable 0: disable.*/
#define SPI_MEM_SADDR_OCT (BIT(20))
#define SPI_MEM_SADDR_OCT_M (BIT(20))
#define SPI_MEM_SADDR_OCT_V 0x1
#define SPI_MEM_SADDR_OCT_S 20
/* SPI_MEM_SDOUT_OCT : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: For SPI0 sram  dout phase apply 8 signals. 1: enable 0: disable.*/
#define SPI_MEM_SDOUT_OCT (BIT(19))
#define SPI_MEM_SDOUT_OCT_M (BIT(19))
#define SPI_MEM_SDOUT_OCT_V 0x1
#define SPI_MEM_SDOUT_OCT_S 19
/* SPI_MEM_SDIN_OCT : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: For SPI0 sram  din phase apply 8 signals. 1: enable 0: disable.*/
#define SPI_MEM_SDIN_OCT (BIT(18))
#define SPI_MEM_SDIN_OCT_M (BIT(18))
#define SPI_MEM_SDIN_OCT_V 0x1
#define SPI_MEM_SDIN_OCT_S 18
/* SPI_MEM_SCMD_QUAD : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: For SPI0 sram  cmd phase apply 4 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_qio.*/
#define SPI_MEM_SCMD_QUAD (BIT(17))
#define SPI_MEM_SCMD_QUAD_M (BIT(17))
#define SPI_MEM_SCMD_QUAD_V 0x1
#define SPI_MEM_SCMD_QUAD_S 17
/* SPI_MEM_SADDR_QUAD : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: For SPI0 sram  address phase apply 4 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_qio.*/
#define SPI_MEM_SADDR_QUAD (BIT(16))
#define SPI_MEM_SADDR_QUAD_M (BIT(16))
#define SPI_MEM_SADDR_QUAD_V 0x1
#define SPI_MEM_SADDR_QUAD_S 16
/* SPI_MEM_SDOUT_QUAD : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: For SPI0 sram  dout phase apply 4 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_qio.*/
#define SPI_MEM_SDOUT_QUAD (BIT(15))
#define SPI_MEM_SDOUT_QUAD_M (BIT(15))
#define SPI_MEM_SDOUT_QUAD_V 0x1
#define SPI_MEM_SDOUT_QUAD_S 15
/* SPI_MEM_SDIN_QUAD : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: For SPI0 sram  din phase apply 4 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_qio.*/
#define SPI_MEM_SDIN_QUAD (BIT(14))
#define SPI_MEM_SDIN_QUAD_M (BIT(14))
#define SPI_MEM_SDIN_QUAD_V 0x1
#define SPI_MEM_SDIN_QUAD_S 14
/* SPI_MEM_SCMD_DUAL : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: For SPI0 sram  cmd phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_dio.*/
#define SPI_MEM_SCMD_DUAL (BIT(13))
#define SPI_MEM_SCMD_DUAL_M (BIT(13))
#define SPI_MEM_SCMD_DUAL_V 0x1
#define SPI_MEM_SCMD_DUAL_S 13
/* SPI_MEM_SADDR_DUAL : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: For SPI0 sram  address phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_dio.*/
#define SPI_MEM_SADDR_DUAL (BIT(12))
#define SPI_MEM_SADDR_DUAL_M (BIT(12))
#define SPI_MEM_SADDR_DUAL_V 0x1
#define SPI_MEM_SADDR_DUAL_S 12
/* SPI_MEM_SDOUT_DUAL : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: For SPI0 sram  dout phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_dio.*/
#define SPI_MEM_SDOUT_DUAL (BIT(11))
#define SPI_MEM_SDOUT_DUAL_M (BIT(11))
#define SPI_MEM_SDOUT_DUAL_V 0x1
#define SPI_MEM_SDOUT_DUAL_S 11
/* SPI_MEM_SDIN_DUAL : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: For SPI0 sram  din phase apply 2 signals. 1: enable 0: disable.
 The bit is the same with spi_mem_usr_sram_dio.*/
#define SPI_MEM_SDIN_DUAL (BIT(10))
#define SPI_MEM_SDIN_DUAL_M (BIT(10))
#define SPI_MEM_SDIN_DUAL_V 0x1
#define SPI_MEM_SDIN_DUAL_S 10
/* SPI_MEM_SWB_MODE : R/W ;bitpos:[9:2] ;default: 8'b0 ; */
/*description: Mode bits in the psram fast read mode  it is combined with spi_mem_fastrd_mode
 bit.*/
#define SPI_MEM_SWB_MODE 0x000000FF
#define SPI_MEM_SWB_MODE_M ((SPI_MEM_SWB_MODE_V) << (SPI_MEM_SWB_MODE_S))
#define SPI_MEM_SWB_MODE_V 0xFF
#define SPI_MEM_SWB_MODE_S 2
/* SPI_MEM_SCLK_MODE : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: SPI clock mode bits. 0: SPI clock is off when CS inactive 1:
 SPI clock is delayed one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3: SPI clock is alwasy on.*/
#define SPI_MEM_SCLK_MODE 0x00000003
#define SPI_MEM_SCLK_MODE_M ((SPI_MEM_SCLK_MODE_V) << (SPI_MEM_SCLK_MODE_S))
#define SPI_MEM_SCLK_MODE_V 0x3
#define SPI_MEM_SCLK_MODE_S 0

