espressif/esp-idf/components/soc/soc/esp32s3/include/soc/spi_mem_reg.h
#define SPI_MEM_SRAM_DRD_CMD_REG(i) (REG_SPI_MEM_BASE(i) + 0x048)
/* SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the length in bits of
 command phase for sram. The register value shall be (bit_num-1).*/
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN 0x0000000F
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_M ((SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V) << (SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S))
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V 0xF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S 28
/* SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the read command value
 of command phase for sram.*/
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE 0x0000FFFF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_M ((SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V) << (SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S))
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V 0xFFFF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S 0

#define SPI_MEM_SRAM_DWR_CMD_REG(i) (REG_SPI_MEM_BASE(i) + 0x04C)
/* SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the in bits of command
 phase  for sram. The register value shall be (bit_num-1).*/
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN 0x0000000F
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_M ((SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V) << (SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S))
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V 0xF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S 28
/* SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the write command value
 of command phase for sram.*/
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE 0x0000FFFF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_M ((SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V) << (SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S))
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V 0xFFFF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S 0

#define SPI_MEM_SRAM_CLK_REG(i) (REG_SPI_MEM_BASE(i) + 0x050)
/* SPI_MEM_SCLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: For SPI0 sram interface  1: spi_mem_clk is eqaul to system 0:
 spi_mem_clk is divided from system clock.*/
#define SPI_MEM_SCLK_EQU_SYSCLK (BIT(31))
#define SPI_MEM_SCLK_EQU_SYSCLK_M (BIT(31))
#define SPI_MEM_SCLK_EQU_SYSCLK_V 0x1
#define SPI_MEM_SCLK_EQU_SYSCLK_S 31
/* SPI_MEM_SCLKCNT_N : R/W ;bitpos:[23:16] ;default: 8'h3 ; */
/*description: For SPI0 sram interface  it is the divider of spi_mem_clk. So
 spi_mem_clk frequency is system/(spi_mem_clkcnt_N+1)*/
#define SPI_MEM_SCLKCNT_N 0x000000FF
#define SPI_MEM_SCLKCNT_N_M ((SPI_MEM_SCLKCNT_N_V) << (SPI_MEM_SCLKCNT_N_S))
#define SPI_MEM_SCLKCNT_N_V 0xFF
#define SPI_MEM_SCLKCNT_N_S 16
/* SPI_MEM_SCLKCNT_H : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: For SPI0 sram interface  it must be floor((spi_mem_clkcnt_N+1)/2-1).*/
#define SPI_MEM_SCLKCNT_H 0x000000FF
#define SPI_MEM_SCLKCNT_H_M ((SPI_MEM_SCLKCNT_H_V) << (SPI_MEM_SCLKCNT_H_S))
#define SPI_MEM_SCLKCNT_H_V 0xFF
#define SPI_MEM_SCLKCNT_H_S 8
/* SPI_MEM_SCLKCNT_L : R/W ;bitpos:[7:0] ;default: 8'h3 ; */
/*description: For SPI0 sram interface  it must be equal to spi_mem_clkcnt_N.*/
#define SPI_MEM_SCLKCNT_L 0x000000FF
#define SPI_MEM_SCLKCNT_L_M ((SPI_MEM_SCLKCNT_L_V) << (SPI_MEM_SCLKCNT_L_S))
#define SPI_MEM_SCLKCNT_L_V 0xFF
#define SPI_MEM_SCLKCNT_L_S 0

#define SPI_MEM_FSM_REG(i) (REG_SPI_MEM_BASE(i) + 0x054)
/* SPI_MEM_ST : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: The status of spi state machine. 0: idle state  1: preparation
 state  2: send command state  3: send data state  4: red data state  5:write data state  6: wait state  7: done state.*/
#define SPI_MEM_ST 0x00000007
#define SPI_MEM_ST_M ((SPI_MEM_ST_V) << (SPI_MEM_ST_S))
#define SPI_MEM_ST_V 0x7
#define SPI_MEM_ST_S 0

#define SPI_MEM_TIMING_CALI_REG(i) (REG_SPI_MEM_BASE(i) + 0x0A8)
/* SPI_MEM_EXTRA_DUMMY_CYCLELEN : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: add extra dummy spi clock cycle length for spi clock calibration.*/
#define SPI_MEM_EXTRA_DUMMY_CYCLELEN 0x00000007
#define SPI_MEM_EXTRA_DUMMY_CYCLELEN_M ((SPI_MEM_EXTRA_DUMMY_CYCLELEN_V) << (SPI_MEM_EXTRA_DUMMY_CYCLELEN_S))
#define SPI_MEM_EXTRA_DUMMY_CYCLELEN_V 0x7
#define SPI_MEM_EXTRA_DUMMY_CYCLELEN_S 2
/* SPI_MEM_TIMING_CALI : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable timing auto-calibration for all reading operations.*/
#define SPI_MEM_TIMING_CALI (BIT(1))
#define SPI_MEM_TIMING_CALI_M (BIT(1))
#define SPI_MEM_TIMING_CALI_V 0x1
#define SPI_MEM_TIMING_CALI_S 1
/* SPI_MEM_TIMING_CLK_ENA : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to enable timing adjust clock for all reading operations.*/
#define SPI_MEM_TIMING_CLK_ENA (BIT(0))
#define SPI_MEM_TIMING_CLK_ENA_M (BIT(0))
#define SPI_MEM_TIMING_CLK_ENA_V 0x1
#define SPI_MEM_TIMING_CLK_ENA_S 0

#define SPI_MEM_DIN_MODE_REG(i) (REG_SPI_MEM_BASE(i) + 0x0AC)
/* SPI_MEM_DINS_MODE : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DINS_MODE 0x00000003
#define SPI_MEM_DINS_MODE_M ((SPI_MEM_DINS_MODE_V) << (SPI_MEM_DINS_MODE_S))
#define SPI_MEM_DINS_MODE_V 0x3
#define SPI_MEM_DINS_MODE_S 16
/* SPI_MEM_DIN7_MODE : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN7_MODE 0x00000003
#define SPI_MEM_DIN7_MODE_M ((SPI_MEM_DIN7_MODE_V) << (SPI_MEM_DIN7_MODE_S))
#define SPI_MEM_DIN7_MODE_V 0x3
#define SPI_MEM_DIN7_MODE_S 14
/* SPI_MEM_DIN6_MODE : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN6_MODE 0x00000003
#define SPI_MEM_DIN6_MODE_M ((SPI_MEM_DIN6_MODE_V) << (SPI_MEM_DIN6_MODE_S))
#define SPI_MEM_DIN6_MODE_V 0x3
#define SPI_MEM_DIN6_MODE_S 12
/* SPI_MEM_DIN5_MODE : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN5_MODE 0x00000003
#define SPI_MEM_DIN5_MODE_M ((SPI_MEM_DIN5_MODE_V) << (SPI_MEM_DIN5_MODE_S))
#define SPI_MEM_DIN5_MODE_V 0x3
#define SPI_MEM_DIN5_MODE_S 10
/* SPI_MEM_DIN4_MODE : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN4_MODE 0x00000003
#define SPI_MEM_DIN4_MODE_M ((SPI_MEM_DIN4_MODE_V) << (SPI_MEM_DIN4_MODE_S))
#define SPI_MEM_DIN4_MODE_V 0x3
#define SPI_MEM_DIN4_MODE_S 8
/* SPI_MEM_DIN3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_DIN3_MODE 0x00000003
#define SPI_MEM_DIN3_MODE_M ((SPI_MEM_DIN3_MODE_V) << (SPI_MEM_DIN3_MODE_S))
#define SPI_MEM_DIN3_MODE_V 0x3
#define SPI_MEM_DIN3_MODE_S 6
/* SPI_MEM_DIN2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_DIN2_MODE 0x00000003
#define SPI_MEM_DIN2_MODE_M ((SPI_MEM_DIN2_MODE_V) << (SPI_MEM_DIN2_MODE_S))
#define SPI_MEM_DIN2_MODE_V 0x3
#define SPI_MEM_DIN2_MODE_S 4
/* SPI_MEM_DIN1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_DIN1_MODE 0x00000003
#define SPI_MEM_DIN1_MODE_M ((SPI_MEM_DIN1_MODE_V) << (SPI_MEM_DIN1_MODE_S))
#define SPI_MEM_DIN1_MODE_V 0x3
#define SPI_MEM_DIN1_MODE_S 2
/* SPI_MEM_DIN0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_DIN0_MODE 0x00000003
#define SPI_MEM_DIN0_MODE_M ((SPI_MEM_DIN0_MODE_V) << (SPI_MEM_DIN0_MODE_S))
#define SPI_MEM_DIN0_MODE_V 0x3
#define SPI_MEM_DIN0_MODE_S 0

#define SPI_MEM_DIN_NUM_REG(i) (REG_SPI_MEM_BASE(i) + 0x0B0)
/* SPI_MEM_DINS_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DINS_NUM 0x00000003
#define SPI_MEM_DINS_NUM_M ((SPI_MEM_DINS_NUM_V) << (SPI_MEM_DINS_NUM_S))
#define SPI_MEM_DINS_NUM_V 0x3
#define SPI_MEM_DINS_NUM_S 16
/* SPI_MEM_DIN7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN7_NUM 0x00000003
#define SPI_MEM_DIN7_NUM_M ((SPI_MEM_DIN7_NUM_V) << (SPI_MEM_DIN7_NUM_S))
#define SPI_MEM_DIN7_NUM_V 0x3
#define SPI_MEM_DIN7_NUM_S 14
/* SPI_MEM_DIN6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN6_NUM 0x00000003
#define SPI_MEM_DIN6_NUM_M ((SPI_MEM_DIN6_NUM_V) << (SPI_MEM_DIN6_NUM_S))
#define SPI_MEM_DIN6_NUM_V 0x3
#define SPI_MEM_DIN6_NUM_S 12
/* SPI_MEM_DIN5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN5_NUM 0x00000003
#define SPI_MEM_DIN5_NUM_M ((SPI_MEM_DIN5_NUM_V) << (SPI_MEM_DIN5_NUM_S))
#define SPI_MEM_DIN5_NUM_V 0x3
#define SPI_MEM_DIN5_NUM_S 10
/* SPI_MEM_DIN4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN4_NUM 0x00000003
#define SPI_MEM_DIN4_NUM_M ((SPI_MEM_DIN4_NUM_V) << (SPI_MEM_DIN4_NUM_S))
#define SPI_MEM_DIN4_NUM_V 0x3
#define SPI_MEM_DIN4_NUM_S 8
/* SPI_MEM_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN3_NUM 0x00000003
#define SPI_MEM_DIN3_NUM_M ((SPI_MEM_DIN3_NUM_V) << (SPI_MEM_DIN3_NUM_S))
#define SPI_MEM_DIN3_NUM_V 0x3
#define SPI_MEM_DIN3_NUM_S 6
/* SPI_MEM_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN2_NUM 0x00000003
#define SPI_MEM_DIN2_NUM_M ((SPI_MEM_DIN2_NUM_V) << (SPI_MEM_DIN2_NUM_S))
#define SPI_MEM_DIN2_NUM_V 0x3
#define SPI_MEM_DIN2_NUM_S 4
/* SPI_MEM_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN1_NUM 0x00000003
#define SPI_MEM_DIN1_NUM_M ((SPI_MEM_DIN1_NUM_V) << (SPI_MEM_DIN1_NUM_S))
#define SPI_MEM_DIN1_NUM_V 0x3
#define SPI_MEM_DIN1_NUM_S 2
/* SPI_MEM_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN0_NUM 0x00000003
#define SPI_MEM_DIN0_NUM_M ((SPI_MEM_DIN0_NUM_V) << (SPI_MEM_DIN0_NUM_S))
#define SPI_MEM_DIN0_NUM_V 0x3
#define SPI_MEM_DIN0_NUM_S 0

#define SPI_MEM_DOUT_MODE_REG(i) (REG_SPI_MEM_BASE(i) + 0x0B4)
/* SPI_MEM_DOUTS_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUTS_MODE (BIT(8))
#define SPI_MEM_DOUTS_MODE_M (BIT(8))
#define SPI_MEM_DOUTS_MODE_V 0x1
#define SPI_MEM_DOUTS_MODE_S 8
/* SPI_MEM_DOUT7_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT7_MODE (BIT(7))
#define SPI_MEM_DOUT7_MODE_M (BIT(7))
#define SPI_MEM_DOUT7_MODE_V 0x1
#define SPI_MEM_DOUT7_MODE_S 7
/* SPI_MEM_DOUT6_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT6_MODE (BIT(6))
#define SPI_MEM_DOUT6_MODE_M (BIT(6))
#define SPI_MEM_DOUT6_MODE_V 0x1
#define SPI_MEM_DOUT6_MODE_S 6
/* SPI_MEM_DOUT5_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT5_MODE (BIT(5))
#define SPI_MEM_DOUT5_MODE_M (BIT(5))
#define SPI_MEM_DOUT5_MODE_V 0x1
#define SPI_MEM_DOUT5_MODE_S 5
/* SPI_MEM_DOUT4_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT4_MODE (BIT(4))
#define SPI_MEM_DOUT4_MODE_M (BIT(4))
#define SPI_MEM_DOUT4_MODE_V 0x1
#define SPI_MEM_DOUT4_MODE_S 4
/* SPI_MEM_DOUT3_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_DOUT3_MODE (BIT(3))
#define SPI_MEM_DOUT3_MODE_M (BIT(3))
#define SPI_MEM_DOUT3_MODE_V 0x1
#define SPI_MEM_DOUT3_MODE_S 3
/* SPI_MEM_DOUT2_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_DOUT2_MODE (BIT(2))
#define SPI_MEM_DOUT2_MODE_M (BIT(2))
#define SPI_MEM_DOUT2_MODE_V 0x1
#define SPI_MEM_DOUT2_MODE_S 2
/* SPI_MEM_DOUT1_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_DOUT1_MODE (BIT(1))
#define SPI_MEM_DOUT1_MODE_M (BIT(1))
#define SPI_MEM_DOUT1_MODE_V 0x1
#define SPI_MEM_DOUT1_MODE_S 1
/* SPI_MEM_DOUT0_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_DOUT0_MODE (BIT(0))
#define SPI_MEM_DOUT0_MODE_M (BIT(0))
#define SPI_MEM_DOUT0_MODE_V 0x1
#define SPI_MEM_DOUT0_MODE_S 0

#define SPI_MEM_SPI_SMEM_TIMING_CALI_REG(i) (REG_SPI_MEM_BASE(i) + 0x0BC)
/* SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: For sram  add extra dummy spi clock cycle length for spi clock calibration.*/
#define SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN 0x00000007
#define SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_M ((SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_V) << (SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_S))
#define SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_V 0x7
#define SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_S 2
/* SPI_MEM_SPI_SMEM_TIMING_CALI : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For sram  the bit is used to enable timing auto-calibration for
 all reading operations.*/
#define SPI_MEM_SPI_SMEM_TIMING_CALI (BIT(1))
#define SPI_MEM_SPI_SMEM_TIMING_CALI_M (BIT(1))
#define SPI_MEM_SPI_SMEM_TIMING_CALI_V 0x1
#define SPI_MEM_SPI_SMEM_TIMING_CALI_S 1
/* SPI_MEM_SPI_SMEM_TIMING_CLK_ENA : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: For sram  the bit is used to enable timing adjust clock for all
 reading operations.*/
#define SPI_MEM_SPI_SMEM_TIMING_CLK_ENA (BIT(0))
#define SPI_MEM_SPI_SMEM_TIMING_CLK_ENA_M (BIT(0))
#define SPI_MEM_SPI_SMEM_TIMING_CLK_ENA_V 0x1
#define SPI_MEM_SPI_SMEM_TIMING_CLK_ENA_S 0

