espressif/esp-idf/components/soc/soc/esp32s3/include/soc/spi_mem_reg.h
#define SPI_MEM_SPI_SMEM_DIN_MODE_REG(i) (REG_SPI_MEM_BASE(i) + 0x0C0)
/* SPI_MEM_SPI_SMEM_DINS_MODE : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DINS_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DINS_MODE_M ((SPI_MEM_SPI_SMEM_DINS_MODE_V) << (SPI_MEM_SPI_SMEM_DINS_MODE_S))
#define SPI_MEM_SPI_SMEM_DINS_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DINS_MODE_S 16
/* SPI_MEM_SPI_SMEM_DIN7_MODE : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN7_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN7_MODE_M ((SPI_MEM_SPI_SMEM_DIN7_MODE_V) << (SPI_MEM_SPI_SMEM_DIN7_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN7_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN7_MODE_S 14
/* SPI_MEM_SPI_SMEM_DIN6_MODE : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN6_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN6_MODE_M ((SPI_MEM_SPI_SMEM_DIN6_MODE_V) << (SPI_MEM_SPI_SMEM_DIN6_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN6_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN6_MODE_S 12
/* SPI_MEM_SPI_SMEM_DIN5_MODE : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN5_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN5_MODE_M ((SPI_MEM_SPI_SMEM_DIN5_MODE_V) << (SPI_MEM_SPI_SMEM_DIN5_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN5_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN5_MODE_S 10
/* SPI_MEM_SPI_SMEM_DIN4_MODE : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN4_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN4_MODE_M ((SPI_MEM_SPI_SMEM_DIN4_MODE_V) << (SPI_MEM_SPI_SMEM_DIN4_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN4_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN4_MODE_S 8
/* SPI_MEM_SPI_SMEM_DIN3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN3_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN3_MODE_M ((SPI_MEM_SPI_SMEM_DIN3_MODE_V) << (SPI_MEM_SPI_SMEM_DIN3_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN3_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN3_MODE_S 6
/* SPI_MEM_SPI_SMEM_DIN2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN2_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN2_MODE_M ((SPI_MEM_SPI_SMEM_DIN2_MODE_V) << (SPI_MEM_SPI_SMEM_DIN2_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN2_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN2_MODE_S 4
/* SPI_MEM_SPI_SMEM_DIN1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN1_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN1_MODE_M ((SPI_MEM_SPI_SMEM_DIN1_MODE_V) << (SPI_MEM_SPI_SMEM_DIN1_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN1_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN1_MODE_S 2
/* SPI_MEM_SPI_SMEM_DIN0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DIN0_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DIN0_MODE_M ((SPI_MEM_SPI_SMEM_DIN0_MODE_V) << (SPI_MEM_SPI_SMEM_DIN0_MODE_S))
#define SPI_MEM_SPI_SMEM_DIN0_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DIN0_MODE_S 0

#define SPI_MEM_SPI_SMEM_DIN_NUM_REG(i) (REG_SPI_MEM_BASE(i) + 0x0C4)
/* SPI_MEM_SPI_SMEM_DINS_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb   3: input with the posedge of clk_160  4 input with the negedge of clk_160  5: input with the spi_clk high edge   6: input with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DINS_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DINS_NUM_M ((SPI_MEM_SPI_SMEM_DINS_NUM_V) << (SPI_MEM_SPI_SMEM_DINS_NUM_S))
#define SPI_MEM_SPI_SMEM_DINS_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DINS_NUM_S 16
/* SPI_MEM_SPI_SMEM_DIN7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN7_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN7_NUM_M ((SPI_MEM_SPI_SMEM_DIN7_NUM_V) << (SPI_MEM_SPI_SMEM_DIN7_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN7_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN7_NUM_S 14
/* SPI_MEM_SPI_SMEM_DIN6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN6_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN6_NUM_M ((SPI_MEM_SPI_SMEM_DIN6_NUM_V) << (SPI_MEM_SPI_SMEM_DIN6_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN6_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN6_NUM_S 12
/* SPI_MEM_SPI_SMEM_DIN5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN5_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN5_NUM_M ((SPI_MEM_SPI_SMEM_DIN5_NUM_V) << (SPI_MEM_SPI_SMEM_DIN5_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN5_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN5_NUM_S 10
/* SPI_MEM_SPI_SMEM_DIN4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN4_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN4_NUM_M ((SPI_MEM_SPI_SMEM_DIN4_NUM_V) << (SPI_MEM_SPI_SMEM_DIN4_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN4_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN4_NUM_S 8
/* SPI_MEM_SPI_SMEM_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN3_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN3_NUM_M ((SPI_MEM_SPI_SMEM_DIN3_NUM_V) << (SPI_MEM_SPI_SMEM_DIN3_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN3_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN3_NUM_S 6
/* SPI_MEM_SPI_SMEM_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN2_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN2_NUM_M ((SPI_MEM_SPI_SMEM_DIN2_NUM_V) << (SPI_MEM_SPI_SMEM_DIN2_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN2_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN2_NUM_S 4
/* SPI_MEM_SPI_SMEM_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN1_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN1_NUM_M ((SPI_MEM_SPI_SMEM_DIN1_NUM_V) << (SPI_MEM_SPI_SMEM_DIN1_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN1_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN1_NUM_S 2
/* SPI_MEM_SPI_SMEM_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SPI_SMEM_DIN0_NUM 0x00000003
#define SPI_MEM_SPI_SMEM_DIN0_NUM_M ((SPI_MEM_SPI_SMEM_DIN0_NUM_V) << (SPI_MEM_SPI_SMEM_DIN0_NUM_S))
#define SPI_MEM_SPI_SMEM_DIN0_NUM_V 0x3
#define SPI_MEM_SPI_SMEM_DIN0_NUM_S 0

#define SPI_MEM_SPI_SMEM_DOUT_MODE_REG(i) (REG_SPI_MEM_BASE(i) + 0x0C8)
/* SPI_MEM_SPI_SMEM_DOUTS_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUTS_MODE (BIT(8))
#define SPI_MEM_SPI_SMEM_DOUTS_MODE_M (BIT(8))
#define SPI_MEM_SPI_SMEM_DOUTS_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUTS_MODE_S 8
/* SPI_MEM_SPI_SMEM_DOUT7_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT7_MODE (BIT(7))
#define SPI_MEM_SPI_SMEM_DOUT7_MODE_M (BIT(7))
#define SPI_MEM_SPI_SMEM_DOUT7_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT7_MODE_S 7
/* SPI_MEM_SPI_SMEM_DOUT6_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT6_MODE (BIT(6))
#define SPI_MEM_SPI_SMEM_DOUT6_MODE_M (BIT(6))
#define SPI_MEM_SPI_SMEM_DOUT6_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT6_MODE_S 6
/* SPI_MEM_SPI_SMEM_DOUT5_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT5_MODE (BIT(5))
#define SPI_MEM_SPI_SMEM_DOUT5_MODE_M (BIT(5))
#define SPI_MEM_SPI_SMEM_DOUT5_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT5_MODE_S 5
/* SPI_MEM_SPI_SMEM_DOUT4_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT4_MODE (BIT(4))
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_M (BIT(4))
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_S 4
/* SPI_MEM_SPI_SMEM_DOUT3_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT3_MODE (BIT(3))
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_M (BIT(3))
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_S 3
/* SPI_MEM_SPI_SMEM_DOUT2_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT2_MODE (BIT(2))
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_M (BIT(2))
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_S 2
/* SPI_MEM_SPI_SMEM_DOUT1_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT1_MODE (BIT(1))
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_M (BIT(1))
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_S 1
/* SPI_MEM_SPI_SMEM_DOUT0_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the posedge of clk_160 4 output with the negedge of clk_160 5: output with the spi_clk high edge  6: output with the spi_clk low edge*/
#define SPI_MEM_SPI_SMEM_DOUT0_MODE (BIT(0))
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_M (BIT(0))
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_S 0

#define SPI_MEM_SPI_SMEM_AC_REG(i) (REG_SPI_MEM_BASE(i) + 0x0D0)
/* SPI_MEM_SPI_SMEM_CS_HOLD_DELAY : R/W ;bitpos:[30:25] ;default: 6'd0 ; */
/*description: These bits are used to set the minimum CS high time tSHSL between
 SPI burst transfer when accesses to external RAM. tSHSL is (SPI_SMEM_CS_HOLD_DELAY[5:0] + 1) MSPI core clock cycles.*/
#define SPI_MEM_SPI_SMEM_CS_HOLD_DELAY 0x0000003F
#define SPI_MEM_SPI_SMEM_CS_HOLD_DELAY_M ((SPI_MEM_SPI_SMEM_CS_HOLD_DELAY_V) << (SPI_MEM_SPI_SMEM_CS_HOLD_DELAY_S))
#define SPI_MEM_SPI_SMEM_CS_HOLD_DELAY_V 0x3F
#define SPI_MEM_SPI_SMEM_CS_HOLD_DELAY_S 25
/* SPI_MEM_SPI_SMEM_ECC_16TO18_BYTE_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to enable MSPI ECC 16 bytes data with 2 ECC bytes
 mode when accesses external RAM.*/
#define SPI_MEM_SPI_SMEM_ECC_16TO18_BYTE_EN (BIT(16))
#define SPI_MEM_SPI_SMEM_ECC_16TO18_BYTE_EN_M (BIT(16))
#define SPI_MEM_SPI_SMEM_ECC_16TO18_BYTE_EN_V 0x1
#define SPI_MEM_SPI_SMEM_ECC_16TO18_BYTE_EN_S 16
/* SPI_MEM_SPI_SMEM_ECC_SKIP_PAGE_CORNER : R/W ;bitpos:[15] ;default: 1'b1 ; */
/*description: 1: MSPI skips page corner when accesses external RAM. 0: Not
 skip page corner when accesses external RAM.*/
#define SPI_MEM_SPI_SMEM_ECC_SKIP_PAGE_CORNER (BIT(15))
#define SPI_MEM_SPI_SMEM_ECC_SKIP_PAGE_CORNER_M (BIT(15))
#define SPI_MEM_SPI_SMEM_ECC_SKIP_PAGE_CORNER_V 0x1
#define SPI_MEM_SPI_SMEM_ECC_SKIP_PAGE_CORNER_S 15
/* SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME : R/W ;bitpos:[14:12] ;default: 3'd3 ; */
/*description: SPI_SMEM_CS_HOLD_TIME + SPI_SMEM_ECC_CS_HOLD_TIME is the MSPI
 CS hold cycles in ECC mode when accessed external RAM.*/
#define SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME 0x00000007
#define SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME_M ((SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME_V) << (SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME_S))
#define SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME_V 0x7
#define SPI_MEM_SPI_SMEM_ECC_CS_HOLD_TIME_S 12
/* SPI_MEM_SPI_SMEM_CS_HOLD_TIME : R/W ;bitpos:[11:7] ;default: 5'h1 ; */
/*description: For spi0  spi cs signal is delayed to inactive by spi clock this
 bits are combined with spi_mem_cs_hold bit.*/
#define SPI_MEM_SPI_SMEM_CS_HOLD_TIME 0x0000001F
#define SPI_MEM_SPI_SMEM_CS_HOLD_TIME_M ((SPI_MEM_SPI_SMEM_CS_HOLD_TIME_V) << (SPI_MEM_SPI_SMEM_CS_HOLD_TIME_S))
#define SPI_MEM_SPI_SMEM_CS_HOLD_TIME_V 0x1F
#define SPI_MEM_SPI_SMEM_CS_HOLD_TIME_S 7
/* SPI_MEM_SPI_SMEM_CS_SETUP_TIME : R/W ;bitpos:[6:2] ;default: 5'h1 ; */
/*description: For spi0  (cycles-1) of prepare phase by spi clock this bits
 are combined with spi_mem_cs_setup bit.*/
#define SPI_MEM_SPI_SMEM_CS_SETUP_TIME 0x0000001F
#define SPI_MEM_SPI_SMEM_CS_SETUP_TIME_M ((SPI_MEM_SPI_SMEM_CS_SETUP_TIME_V) << (SPI_MEM_SPI_SMEM_CS_SETUP_TIME_S))
#define SPI_MEM_SPI_SMEM_CS_SETUP_TIME_V 0x1F
#define SPI_MEM_SPI_SMEM_CS_SETUP_TIME_S 2
/* SPI_MEM_SPI_SMEM_CS_HOLD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For spi0  spi cs keep low when spi is in done phase. 1: enable 0: disable.*/
#define SPI_MEM_SPI_SMEM_CS_HOLD (BIT(1))
#define SPI_MEM_SPI_SMEM_CS_HOLD_M (BIT(1))
#define SPI_MEM_SPI_SMEM_CS_HOLD_V 0x1
#define SPI_MEM_SPI_SMEM_CS_HOLD_S 1
/* SPI_MEM_SPI_SMEM_CS_SETUP : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For spi0  spi cs is enable when spi is in prepare phase. 1: enable 0: disable.*/
#define SPI_MEM_SPI_SMEM_CS_SETUP (BIT(0))
#define SPI_MEM_SPI_SMEM_CS_SETUP_M (BIT(0))
#define SPI_MEM_SPI_SMEM_CS_SETUP_V 0x1
#define SPI_MEM_SPI_SMEM_CS_SETUP_S 0

