espressif/esp-idf/components/soc/soc/esp32s3/include/soc/spi_mem_reg.h
#define SPI_MEM_DDR_REG(i) (REG_SPI_MEM_BASE(i) + 0x0D4)
/* SPI_MEM_SPI_FMEM_HYPERBUS_CA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to
 flash  which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4]  13'd0  spi_usr_addr_value[3:1]}.*/
#define SPI_MEM_SPI_FMEM_HYPERBUS_CA (BIT(30))
#define SPI_MEM_SPI_FMEM_HYPERBUS_CA_M (BIT(30))
#define SPI_MEM_SPI_FMEM_HYPERBUS_CA_V 0x1
#define SPI_MEM_SPI_FMEM_HYPERBUS_CA_S 30
/* SPI_MEM_SPI_FMEM_OCTA_RAM_ADDR : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to
 flash  which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4]  6'd0  spi_usr_addr_value[3:1]  1'b0}.*/
#define SPI_MEM_SPI_FMEM_OCTA_RAM_ADDR (BIT(29))
#define SPI_MEM_SPI_FMEM_OCTA_RAM_ADDR_M (BIT(29))
#define SPI_MEM_SPI_FMEM_OCTA_RAM_ADDR_V 0x1
#define SPI_MEM_SPI_FMEM_OCTA_RAM_ADDR_S 29
/* SPI_MEM_SPI_FMEM_CLK_DIFF_INV : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to flash. .*/
#define SPI_MEM_SPI_FMEM_CLK_DIFF_INV (BIT(28))
#define SPI_MEM_SPI_FMEM_CLK_DIFF_INV_M (BIT(28))
#define SPI_MEM_SPI_FMEM_CLK_DIFF_INV_V 0x1
#define SPI_MEM_SPI_FMEM_CLK_DIFF_INV_S 28
/* SPI_MEM_SPI_FMEM_HYPERBUS_DUMMY_2X : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus
 mode  when SPI0 accesses flash or SPI1 accesses flash or sram.*/
#define SPI_MEM_SPI_FMEM_HYPERBUS_DUMMY_2X (BIT(27))
#define SPI_MEM_SPI_FMEM_HYPERBUS_DUMMY_2X_M (BIT(27))
#define SPI_MEM_SPI_FMEM_HYPERBUS_DUMMY_2X_V 0x1
#define SPI_MEM_SPI_FMEM_HYPERBUS_DUMMY_2X_S 27
/* SPI_MEM_SPI_FMEM_DQS_CA_IN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases
 of CMD and ADDR.*/
#define SPI_MEM_SPI_FMEM_DQS_CA_IN (BIT(26))
#define SPI_MEM_SPI_FMEM_DQS_CA_IN_M (BIT(26))
#define SPI_MEM_SPI_FMEM_DQS_CA_IN_V 0x1
#define SPI_MEM_SPI_FMEM_DQS_CA_IN_S 26
/* SPI_MEM_SPI_FMEM_HYPERBUS_MODE : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: Set this bit to enable the SPI HyperBus mode.*/
#define SPI_MEM_SPI_FMEM_HYPERBUS_MODE (BIT(25))
#define SPI_MEM_SPI_FMEM_HYPERBUS_MODE_M (BIT(25))
#define SPI_MEM_SPI_FMEM_HYPERBUS_MODE_V 0x1
#define SPI_MEM_SPI_FMEM_HYPERBUS_MODE_S 25
/* SPI_MEM_SPI_FMEM_CLK_DIFF_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#.*/
#define SPI_MEM_SPI_FMEM_CLK_DIFF_EN (BIT(24))
#define SPI_MEM_SPI_FMEM_CLK_DIFF_EN_M (BIT(24))
#define SPI_MEM_SPI_FMEM_CLK_DIFF_EN_V 0x1
#define SPI_MEM_SPI_FMEM_CLK_DIFF_EN_S 24
/* SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE : R/W ;bitpos:[23:22] ;default: 2'b0 ; */
/*description: the bits are combined with the bit spi_fmem_ddr_fdqs_loop which
 used to select data strobe generating mode in ddr mode.*/
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE 0x00000003
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE_M ((SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE_V) << (SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE_S))
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE_V 0x3
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_MODE_S 22
/* SPI_MEM_SPI_FMEM_DDR_DQS_LOOP : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: the data strobe is generated by SPI.*/
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP (BIT(21))
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_M (BIT(21))
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_V 0x1
#define SPI_MEM_SPI_FMEM_DDR_DQS_LOOP_S 21
/* SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD : R/W ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock.*/
#define SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD 0x0000007F
#define SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD_M ((SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD_V) << (SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD_S))
#define SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD_V 0x7F
#define SPI_MEM_SPI_FMEM_USR_DDR_DQS_THD_S 14
/* SPI_MEM_SPI_FMEM_RX_DDR_MSK_EN : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in MSPI ECC DDR
 read mode  when accesses to flash.*/
#define SPI_MEM_SPI_FMEM_RX_DDR_MSK_EN (BIT(13))
#define SPI_MEM_SPI_FMEM_RX_DDR_MSK_EN_M (BIT(13))
#define SPI_MEM_SPI_FMEM_RX_DDR_MSK_EN_V 0x1
#define SPI_MEM_SPI_FMEM_RX_DDR_MSK_EN_S 13
/* SPI_MEM_SPI_FMEM_TX_DDR_MSK_EN : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in MSPI ECC DDR
 write mode  when accesses to flash.*/
#define SPI_MEM_SPI_FMEM_TX_DDR_MSK_EN (BIT(12))
#define SPI_MEM_SPI_FMEM_TX_DDR_MSK_EN_M (BIT(12))
#define SPI_MEM_SPI_FMEM_TX_DDR_MSK_EN_V 0x1
#define SPI_MEM_SPI_FMEM_TX_DDR_MSK_EN_S 12
/* SPI_MEM_SPI_FMEM_OUTMINBYTELEN : R/W ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the panda device.*/
#define SPI_MEM_SPI_FMEM_OUTMINBYTELEN 0x0000007F
#define SPI_MEM_SPI_FMEM_OUTMINBYTELEN_M ((SPI_MEM_SPI_FMEM_OUTMINBYTELEN_V) << (SPI_MEM_SPI_FMEM_OUTMINBYTELEN_S))
#define SPI_MEM_SPI_FMEM_OUTMINBYTELEN_V 0x7F
#define SPI_MEM_SPI_FMEM_OUTMINBYTELEN_S 5
/* SPI_MEM_SPI_FMEM_DDR_CMD_DIS : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when ddr mode.*/
#define SPI_MEM_SPI_FMEM_DDR_CMD_DIS (BIT(4))
#define SPI_MEM_SPI_FMEM_DDR_CMD_DIS_M (BIT(4))
#define SPI_MEM_SPI_FMEM_DDR_CMD_DIS_V 0x1
#define SPI_MEM_SPI_FMEM_DDR_CMD_DIS_S 4
/* SPI_MEM_SPI_FMEM_DDR_WDAT_SWP : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi ddr mode.*/
#define SPI_MEM_SPI_FMEM_DDR_WDAT_SWP (BIT(3))
#define SPI_MEM_SPI_FMEM_DDR_WDAT_SWP_M (BIT(3))
#define SPI_MEM_SPI_FMEM_DDR_WDAT_SWP_V 0x1
#define SPI_MEM_SPI_FMEM_DDR_WDAT_SWP_S 3
/* SPI_MEM_SPI_FMEM_DDR_RDAT_SWP : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi ddr mode.*/
#define SPI_MEM_SPI_FMEM_DDR_RDAT_SWP (BIT(2))
#define SPI_MEM_SPI_FMEM_DDR_RDAT_SWP_M (BIT(2))
#define SPI_MEM_SPI_FMEM_DDR_RDAT_SWP_V 0x1
#define SPI_MEM_SPI_FMEM_DDR_RDAT_SWP_S 2
/* SPI_MEM_SPI_FMEM_VAR_DUMMY : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi ddr mode.*/
#define SPI_MEM_SPI_FMEM_VAR_DUMMY (BIT(1))
#define SPI_MEM_SPI_FMEM_VAR_DUMMY_M (BIT(1))
#define SPI_MEM_SPI_FMEM_VAR_DUMMY_V 0x1
#define SPI_MEM_SPI_FMEM_VAR_DUMMY_S 1
/* SPI_MEM_SPI_FMEM_DDR_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in ddr mode   0 in sdr mode*/
#define SPI_MEM_SPI_FMEM_DDR_EN (BIT(0))
#define SPI_MEM_SPI_FMEM_DDR_EN_M (BIT(0))
#define SPI_MEM_SPI_FMEM_DDR_EN_V 0x1
#define SPI_MEM_SPI_FMEM_DDR_EN_S 0

#define SPI_MEM_SPI_SMEM_DDR_REG(i) (REG_SPI_MEM_BASE(i) + 0x0D8)
/* SPI_MEM_SPI_SMEM_HYPERBUS_CA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to
 external RAM  which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4]  13'd0  spi_usr_addr_value[3:1]}.*/
#define SPI_MEM_SPI_SMEM_HYPERBUS_CA (BIT(30))
#define SPI_MEM_SPI_SMEM_HYPERBUS_CA_M (BIT(30))
#define SPI_MEM_SPI_SMEM_HYPERBUS_CA_V 0x1
#define SPI_MEM_SPI_SMEM_HYPERBUS_CA_S 30
/* SPI_MEM_SPI_SMEM_OCTA_RAM_ADDR : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to
 external RAM  which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4]  6'd0  spi_usr_addr_value[3:1]  1'b0}.*/
#define SPI_MEM_SPI_SMEM_OCTA_RAM_ADDR (BIT(29))
#define SPI_MEM_SPI_SMEM_OCTA_RAM_ADDR_M (BIT(29))
#define SPI_MEM_SPI_SMEM_OCTA_RAM_ADDR_V 0x1
#define SPI_MEM_SPI_SMEM_OCTA_RAM_ADDR_S 29
/* SPI_MEM_SPI_SMEM_CLK_DIFF_INV : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to external RAM. .*/
#define SPI_MEM_SPI_SMEM_CLK_DIFF_INV (BIT(28))
#define SPI_MEM_SPI_SMEM_CLK_DIFF_INV_M (BIT(28))
#define SPI_MEM_SPI_SMEM_CLK_DIFF_INV_V 0x1
#define SPI_MEM_SPI_SMEM_CLK_DIFF_INV_S 28
/* SPI_MEM_SPI_SMEM_HYPERBUS_DUMMY_2X : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus
 mode  when SPI0 accesses flash or SPI1 accesses flash or sram.*/
#define SPI_MEM_SPI_SMEM_HYPERBUS_DUMMY_2X (BIT(27))
#define SPI_MEM_SPI_SMEM_HYPERBUS_DUMMY_2X_M (BIT(27))
#define SPI_MEM_SPI_SMEM_HYPERBUS_DUMMY_2X_V 0x1
#define SPI_MEM_SPI_SMEM_HYPERBUS_DUMMY_2X_S 27
/* SPI_MEM_SPI_SMEM_DQS_CA_IN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases
 of CMD and ADDR.*/
#define SPI_MEM_SPI_SMEM_DQS_CA_IN (BIT(26))
#define SPI_MEM_SPI_SMEM_DQS_CA_IN_M (BIT(26))
#define SPI_MEM_SPI_SMEM_DQS_CA_IN_V 0x1
#define SPI_MEM_SPI_SMEM_DQS_CA_IN_S 26
/* SPI_MEM_SPI_SMEM_HYPERBUS_MODE : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: Set this bit to enable the SPI HyperBus mode.*/
#define SPI_MEM_SPI_SMEM_HYPERBUS_MODE (BIT(25))
#define SPI_MEM_SPI_SMEM_HYPERBUS_MODE_M (BIT(25))
#define SPI_MEM_SPI_SMEM_HYPERBUS_MODE_V 0x1
#define SPI_MEM_SPI_SMEM_HYPERBUS_MODE_S 25
/* SPI_MEM_SPI_SMEM_CLK_DIFF_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#.*/
#define SPI_MEM_SPI_SMEM_CLK_DIFF_EN (BIT(24))
#define SPI_MEM_SPI_SMEM_CLK_DIFF_EN_M (BIT(24))
#define SPI_MEM_SPI_SMEM_CLK_DIFF_EN_V 0x1
#define SPI_MEM_SPI_SMEM_CLK_DIFF_EN_S 24
/* SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE : R/W ;bitpos:[23:22] ;default: 2'b0 ; */
/*description: the bits are combined with the bit spi_smem_ddr_fdqs_loop which
 used to select data strobe generating mode in ddr mode.*/
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE 0x00000003
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE_M ((SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE_V) << (SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE_S))
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE_V 0x3
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_MODE_S 22
/* SPI_MEM_SPI_SMEM_DDR_DQS_LOOP : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: the data strobe is generated by SPI.*/
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP (BIT(21))
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_M (BIT(21))
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_V 0x1
#define SPI_MEM_SPI_SMEM_DDR_DQS_LOOP_S 21
/* SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD : R/W ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock.*/
#define SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD 0x0000007F
#define SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD_M ((SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD_V) << (SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD_S))
#define SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD_V 0x7F
#define SPI_MEM_SPI_SMEM_USR_DDR_DQS_THD_S 14
/* SPI_MEM_SPI_SMEM_RX_DDR_MSK_EN : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in MSPI ECC DDR
 read mode  when accesses to external RAM.*/
#define SPI_MEM_SPI_SMEM_RX_DDR_MSK_EN (BIT(13))
#define SPI_MEM_SPI_SMEM_RX_DDR_MSK_EN_M (BIT(13))
#define SPI_MEM_SPI_SMEM_RX_DDR_MSK_EN_V 0x1
#define SPI_MEM_SPI_SMEM_RX_DDR_MSK_EN_S 13
/* SPI_MEM_SPI_SMEM_TX_DDR_MSK_EN : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in MSPI ECC DDR
 write mode  when accesses to external RAM.*/
#define SPI_MEM_SPI_SMEM_TX_DDR_MSK_EN (BIT(12))
#define SPI_MEM_SPI_SMEM_TX_DDR_MSK_EN_M (BIT(12))
#define SPI_MEM_SPI_SMEM_TX_DDR_MSK_EN_V 0x1
#define SPI_MEM_SPI_SMEM_TX_DDR_MSK_EN_S 12
/* SPI_MEM_SPI_SMEM_OUTMINBYTELEN : R/W ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the ddr psram.*/
#define SPI_MEM_SPI_SMEM_OUTMINBYTELEN 0x0000007F
#define SPI_MEM_SPI_SMEM_OUTMINBYTELEN_M ((SPI_MEM_SPI_SMEM_OUTMINBYTELEN_V) << (SPI_MEM_SPI_SMEM_OUTMINBYTELEN_S))
#define SPI_MEM_SPI_SMEM_OUTMINBYTELEN_V 0x7F
#define SPI_MEM_SPI_SMEM_OUTMINBYTELEN_S 5
/* SPI_MEM_SPI_SMEM_DDR_CMD_DIS : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when ddr mode.*/
#define SPI_MEM_SPI_SMEM_DDR_CMD_DIS (BIT(4))
#define SPI_MEM_SPI_SMEM_DDR_CMD_DIS_M (BIT(4))
#define SPI_MEM_SPI_SMEM_DDR_CMD_DIS_V 0x1
#define SPI_MEM_SPI_SMEM_DDR_CMD_DIS_S 4
/* SPI_MEM_SPI_SMEM_DDR_WDAT_SWP : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi ddr mode.*/
#define SPI_MEM_SPI_SMEM_DDR_WDAT_SWP (BIT(3))
#define SPI_MEM_SPI_SMEM_DDR_WDAT_SWP_M (BIT(3))
#define SPI_MEM_SPI_SMEM_DDR_WDAT_SWP_V 0x1
#define SPI_MEM_SPI_SMEM_DDR_WDAT_SWP_S 3
/* SPI_MEM_SPI_SMEM_DDR_RDAT_SWP : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi ddr mode.*/
#define SPI_MEM_SPI_SMEM_DDR_RDAT_SWP (BIT(2))
#define SPI_MEM_SPI_SMEM_DDR_RDAT_SWP_M (BIT(2))
#define SPI_MEM_SPI_SMEM_DDR_RDAT_SWP_V 0x1
#define SPI_MEM_SPI_SMEM_DDR_RDAT_SWP_S 2
/* SPI_MEM_SPI_SMEM_VAR_DUMMY : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi ddr mode.*/
#define SPI_MEM_SPI_SMEM_VAR_DUMMY (BIT(1))
#define SPI_MEM_SPI_SMEM_VAR_DUMMY_M (BIT(1))
#define SPI_MEM_SPI_SMEM_VAR_DUMMY_V 0x1
#define SPI_MEM_SPI_SMEM_VAR_DUMMY_S 1
/* SPI_MEM_SPI_SMEM_DDR_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in ddr mode   0 in sdr mode*/
#define SPI_MEM_SPI_SMEM_DDR_EN (BIT(0))
#define SPI_MEM_SPI_SMEM_DDR_EN_M (BIT(0))
#define SPI_MEM_SPI_SMEM_DDR_EN_V 0x1
#define SPI_MEM_SPI_SMEM_DDR_EN_S 0

#define SPI_MEM_CLOCK_GATE_REG(i) (REG_SPI_MEM_BASE(i) + 0x0DC)
/* SPI_MEM_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: Register clock gate enable signal. 1: Enable. 0: Disable.*/
#define SPI_MEM_CLK_EN (BIT(0))
#define SPI_MEM_CLK_EN_M (BIT(0))
#define SPI_MEM_CLK_EN_V 0x1
#define SPI_MEM_CLK_EN_S 0

#define SPI_MEM_CORE_CLK_SEL_REG(i) (REG_SPI_MEM_BASE(i) + 0x0E0)
/* SPI_MEM_SPI01_CLK_SEL : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: When the digital system clock selects PLL clock and the frequency
 of PLL clock is 480MHz  the value of reg_spi01_clk_sel:  0: SPI0/1 module clock (clk) is 80MHz. 1: SPI0/1 module clock (clk) is 120MHz.  2: SPI0/1 module clock (clk) 160MHz. 3: Not used. When the digital system clock selects PLL clock and the frequency of PLL clock is 320MHz  the value of reg_spi01_clk_sel:  0: SPI0/1 module clock (clk) is 80MHz. 1: SPI0/1 module clock (clk) is 80MHz.  2: SPI0/1 module clock (clk) 160MHz. 3: Not used.*/
#define SPI_MEM_SPI01_CLK_SEL 0x00000003
#define SPI_MEM_SPI01_CLK_SEL_M ((SPI_MEM_SPI01_CLK_SEL_V) << (SPI_MEM_SPI01_CLK_SEL_S))
#define SPI_MEM_SPI01_CLK_SEL_V 0x3
#define SPI_MEM_SPI01_CLK_SEL_S 0

#define SPI_MEM_DATE_REG(i) (REG_SPI_MEM_BASE(i) + 0x3FC)
/* SPI_MEM_DATE : R/W ;bitpos:[27:0] ;default: 28'h2004010 ; */
/*description: SPI register version.*/
#define SPI_MEM_DATE 0x0FFFFFFF
#define SPI_MEM_DATE_M ((SPI_MEM_DATE_V) << (SPI_MEM_DATE_S))
#define SPI_MEM_DATE_V 0xFFFFFFF
#define SPI_MEM_DATE_S 0

#ifdef __cplusplus
}
#endif
